tutorials/compressibleVoF/climbingRod/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    alpha.liquid    0;
}

zones
{
    liquid
    {
        type            box;
        zoneType        cell;

        box             (0 0 -1) (1 0.0771 1);

        values
        {
            alpha.liquid    1;
        }
    }
}

// ************************************************************************* //
